In [2]:
#Defendencies
import pandas as pd

In [7]:
df= pd.read_csv("Resource/Billionaires.csv")

In [8]:
df.head()

,Rank,Name,Net Worth,Age,Country | Territory,Source,Industry
0,1,Bernard Arnault & family,$211 B,74.0,France,LVMH,Fashion & Retail
1,2,Elon Musk,$180 B,51.0,United States,"Tesla, SpaceX",Automotive
2,3,Jeff Bezos,$114 B,59.0,United States,Amazon,Technology
3,4,Larry Ellison,$107 B,78.0,United States,Oracle,Technology
4,5,Warren Buffett,$106 B,92.0,United States,Berkshire Hathaway,Finance & Investments

In [10]:
df.shape

(2640, 7)

In [13]:
df["Net Worth(In Billions)"] = df["Net Worth"].str.replace("$", "").str.replace(" B", "").astype(float)

In [14]:
df.head()

,Rank,Name,Net Worth,Age,Country | Territory,Source,Industry,Net Worth(In Billions)
0,1,Bernard Arnault & family,$211 B,74.0,France,LVMH,Fashion & Retail,211.0
1,2,Elon Musk,$180 B,51.0,United States,"Tesla, SpaceX",Automotive,180.0
2,3,Jeff Bezos,$114 B,59.0,United States,Amazon,Technology,114.0
3,4,Larry Ellison,$107 B,78.0,United States,Oracle,Technology,107.0
4,5,Warren Buffett,$106 B,92.0,United States,Berkshire Hathaway,Finance & Investments,106.0

In [18]:
same_rank  = df[df["Rank"] == 72]
same_rank

,Rank,Name,Net Worth,Age,Country | Territory,Source,Industry,Net Worth(In Billions)
71,72,Abigail Johnson,$21.6 B,61.0,United States,Fidelity,Finance & Investments,21.6
72,72,Leonid Mikhelson & family,$21.6 B,67.0,Russia,"Gas, chemicals",Energy,21.6

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2640 entries, 0 to 2639
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    2640 non-null   int64
 1   Name                    2640 non-null   object
 2   Net Worth               2640 non-null   object
 3   Age                     2576 non-null   float64
 4   Country | Territory     2640 non-null   object
 5   Source                  2640 non-null   object
 6   Industry                2640 non-null   object
 7   Net Worth(In Billions)  2640 non-null   float64
dtypes: float64(2), int64(1), object(5)
memory usage: 165.1+ KB

In [11]:
df.isna().sum()

Rank                    0
Name                    0
Net Worth               0
Age                    64
Country | Territory     0
Source                  0
Industry                0
dtype: int64

In [19]:
df.describe()

              Rank          Age  Net Worth(In Billions)
count  2640.000000  2576.000000             2640.000000
mean   1289.159091    65.134705                4.623788
std     739.693726    13.258245                9.834241
min       1.000000    18.000000                1.000000
25%     659.000000    56.000000                1.500000
50%    1312.000000    65.000000                2.300000
75%    1905.000000    75.000000                4.200000
max    2540.000000   101.000000              211.000000

In [21]:
# imputation method: Treating nulls in "Age" column with median value wiz 65
median_age = df["Age"].median()
df["Age"].fillna(median_age, inplace=True)

In [23]:
df.isna().sum()

Rank                      0
Name                      0
Net Worth                 0
Age                       0
Country | Territory       0
Source                    0
Industry                  0
Net Worth(In Billions)    0
dtype: int64

In [24]:
df["Country | Territory"].value_counts()

Country | Territory
United States           734
China                   490
India                   169
Germany                 126
Russia                  104
                       ...
Belize                    1
Eswatini (Swaziland)      1
Venezuela                 1
Algeria                   1
Panama                    1
Name: count, Length: 77, dtype: int64

In [29]:
df.rename(columns={'Country | Territory': 'Country'}, inplace=True)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2640 entries, 0 to 2639
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    2640 non-null   int64
 1   Name                    2640 non-null   object
 2   Net Worth               2640 non-null   object
 3   Age                     2640 non-null   float64
 4   Country                 2640 non-null   object
 5   Source                  2640 non-null   object
 6   Industry                2640 non-null   object
 7   Net Worth(In Billions)  2640 non-null   float64
dtypes: float64(2), int64(1), object(5)
memory usage: 165.1+ KB

In [31]:
json_data = df.to_json(orient='records')

#Export JSON Data to a file
with open('Billionaires.json', 'w') as f:
    f.write(json_data)